<template>
	<view>
		<text class="content">{{content}}</text>
	</view>
</template>

<script>
	export default {
		data() {
			return {
				content:""
			}
		},
		mounted() {
			this.content = `
			我们希望通过本《隐私政策》向您说明，在使用我们的服务时，我们如何收集、使用、储存和分享这些信息，以及我们为您提供的访问、更新、控制和保护这些信息的方式。
			本《隐私政策》与您所使用的服务息息相关，希望您仔细阅读，在需要时，按照本《隐私政策》的指引，作出您认为适当的选择。
			本《隐私政策》中涉及的相关技术词汇，我们尽量以简明扼要的表述，并提供进一步说明的链接，以便您的理解。
			您使用或继续使用我们的服务，即意味着同意我们按照本《隐私政策》收集、使用、储存和分享您的相关信息。
			
			可能收集的信息
			
			我们提供服务时，可能会收集、储存和使用下列与您有关的信息。如果您不提供相关信息，可能无法享受我们提供的某些服务，或者无法达到相关服务拟达到的效果。
			
			需要获取的权限：
			
			我们的产品使用功能的时候需要用户存储权限，为了确保正常功能的使用会弹出申请该权限。
			
			与服务有关的公告
			
			我们可能在必要时（例如因系统维护而暂停某一项服务时）向您发出与服务有关的公告。您可能无法取消这些与服务有关、性质不属于推广的公告。
			
			隐私政策的适用例外
			
			我们的服务可能包括或链接至第三方提供的社交媒体或其他服务（包括网站）。例如：
			您利用“分享”键将某些内容分享到我们的服务，或您利用第三方连线服务登录我们的服务。这些功能可能会收集您的相关信息（包括您的日志信息），并可能在您的电脑装置cookies，从而正常运行上述功能；
			我们通过广告或我们服务的其他方式向您提供链接，使您可以接入第三方的服务或网站。
			该等第三方社交媒体或其他服务可能由相关的第三方或我们运营。您使用该等第三方的社交媒体服务或其他服务（包括您向该等第三方提供的任何个人信息），须受该第三方的服务条款及隐私政策（而非《通用服务条款》或本《隐私政策》）约束，您需要仔细阅读其条款。本《隐私政策》仅适用于我们所收集的信息，并不适用于任何第三方提供的服务或第三方的信息使用规则，我们对任何第三方使用由您提供的信息不承担任何责任。
			
			未成年人使用服务
			
			我们鼓励父母或监护人指导未满十八岁的未成年人使用我们的服务。我们建议未成年人鼓励他们的父母或监护人阅读本《隐私政策》，并建议未成年人在提交的个人信息之前寻求父母或监护人的同意和指导。
			
			适用范围
			
			除某些特定服务外，我们所有的服务均适用本《隐私政策》。这些特定服务将适用特定的隐私政策。针对某些特定服务的特定隐私政策，将更具体地说明我们在该等服务中如何使用您的信息。该特定服务的隐私政策构成本《隐私政策》的一部分。如相关特定服务的隐私政策与本《隐私政策》有不一致之处，适用该特定服务的隐私政策。
			请您注意，本《隐私政策》不适用于以下情况：
			通过我们的服务而接入的第三方服务（包括任何第三方网站）收集的信息；
			通过在我们服务中进行广告服务的其他公司或机构所收集的信息。
			
			变更
			
			我们可能适时修订本《隐私政策》的条款，该等修订构成本《隐私政策》的一部分。如该等修订造成您在本《隐私政策》下权利的实质减少。在该种情况下，若您继续使用我们的服务，即表示同意受经修订的本《隐私政策》的约束。
			
			更新时间：2022年7月21号
			
			生效时间：2022年7月21号
			`
		},
		methods: {
			
		}
	}
</script>

<style>
	page,
	view {
		display: flex;

	}
	
	page {
		min-height: 100%;
		background-color: #F4F4F4;
	}
	.content{
		padding: 20rpx;
		flex-direction: column;
		justify-content: center;
		font-size: 18rpx;
	}
</style>
